#coding:utf-8

"""
插入排序是在一个已经有序的小序列的基础上，一次插入一个元素。

当然，刚开始这个有序的小序列只有1个元素，就是第一个元素。比较是从有序序列的末尾开 始，也就是想要插入的元素和已经有序的最大者开始比起，如果比它大则直接插入在其后面，否则一直往前找直到找到它该插入的位置。

如果碰见一个和插入元素相 等的，那么插入元素把想插入的元素放在相等元素的后面。

所以，相等元素的前后顺序没有改变，从原无序序列出去的顺序就是排好序后的顺序，所以插入排序是稳定的。

"""
def insert_sort(l):
    n = len(l)
    for i in range(1,n):
        j = i - 1
        while(l[i] < l[j]):
            tmp = l[i]
            l[i] = l[j]
            l[j] = tmp

            if j > 0 and i > 0:
                j -= 1
                i -= 1

    return l

test_list = [20,11,2]
test = insert_sort(test_list)
print(test)

